zephyrproject-rtos/hal_nxp/dts/nxp/kinetis/ke1xz/pinctrl/MKE17Z512VLL9-pinctrl.h
/*
 * NOTE: Autogenerated file by gen_soc_headers.py
 * for MKE17Z512VLL9/signal_configuration.xml
 *
 * Copyright 2024 NXP
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#ifndef _ZEPHYR_DTS_BINDING_MKE17Z512VLL9_
#define _ZEPHYR_DTS_BINDING_MKE17Z512VLL9_

#define ACMP0_IN0_PTA0 KINETIS_MUX('A',0,0)
#define ACMP0_IN1_PTA1 KINETIS_MUX('A',1,0)
#define ACMP0_IN2_PTC4 KINETIS_MUX('C',4,0)
#define ACMP0_IN3_PTE8 KINETIS_MUX('E',8,0)
#define ACMP0_IN4_PTC3 KINETIS_MUX('C',3,0)
#define ACMP0_IN5_PTC2 KINETIS_MUX('C',2,0)
#define ACMP0_OUT_PTA4 KINETIS_MUX('A',4,4)
#define ADC0_SE14_PTC16 KINETIS_MUX('C',16,0)
#define BUSOUT_PTA14 KINETIS_MUX('A',14,7)
#define BUSOUT_PTE4 KINETIS_MUX('E',4,2)
#define CLKOUT_PTD14 KINETIS_MUX('D',14,7)
#define CLKOUT_PTE10 KINETIS_MUX('E',10,2)
#define EWM_IN_PTA14 KINETIS_MUX('A',14,4)
#define EWM_IN_PTA3 KINETIS_MUX('A',3,4)
#define EWM_IN_PTC4 KINETIS_MUX('C',4,5)
#define EWM_IN_PTE5 KINETIS_MUX('E',5,7)
#define EWM_OUT_b_PTA17 KINETIS_MUX('A',17,4)
#define EWM_OUT_b_PTA2 KINETIS_MUX('A',2,4)
#define EWM_OUT_b_PTA4 KINETIS_MUX('A',4,5)
#define EWM_OUT_b_PTE4 KINETIS_MUX('E',4,7)
#define EXTAL_PTB7 KINETIS_MUX('B',7,0)
#define FTM0_CH0_PTB12 KINETIS_MUX('B',12,2)
#define FTM0_CH0_PTC0 KINETIS_MUX('C',0,2)
#define FTM0_CH0_PTD15 KINETIS_MUX('D',15,2)
#define FTM0_CH1_PTB13 KINETIS_MUX('B',13,2)
#define FTM0_CH1_PTC1 KINETIS_MUX('C',1,2)
#define FTM0_CH1_PTD16 KINETIS_MUX('D',16,2)
#define FTM0_CH2_PTB14 KINETIS_MUX('B',14,2)
#define FTM0_CH2_PTC2 KINETIS_MUX('C',2,2)
#define FTM0_CH2_PTD0 KINETIS_MUX('D',0,2)
#define FTM0_CH3_PTB15 KINETIS_MUX('B',15,2)
#define FTM0_CH3_PTC3 KINETIS_MUX('C',3,2)
#define FTM0_CH3_PTD1 KINETIS_MUX('D',1,2)
#define FTM0_CH4_PTB16 KINETIS_MUX('B',16,2)
#define FTM0_CH4_PTB4 KINETIS_MUX('B',4,2)
#define FTM0_CH5_PTB17 KINETIS_MUX('B',17,2)
#define FTM0_CH5_PTB5 KINETIS_MUX('B',5,2)
#define FTM0_CH6_PTA17 KINETIS_MUX('A',17,2)
#define FTM0_CH6_PTE8 KINETIS_MUX('E',8,2)
#define FTM0_CH7_PTE7 KINETIS_MUX('E',7,2)
#define FTM0_CH7_PTE9 KINETIS_MUX('E',9,2)
#define FTM0_FLT0_PTA14 KINETIS_MUX('A',14,2)
#define FTM0_FLT0_PTE3 KINETIS_MUX('E',3,2)
#define FTM0_FLT1_PTA6 KINETIS_MUX('A',6,2)
#define FTM0_FLT1_PTE14 KINETIS_MUX('E',14,2)
#define FTM0_FLT2_PTA7 KINETIS_MUX('A',7,2)
#define FTM0_FLT2_PTD17 KINETIS_MUX('D',17,2)
#define FTM0_FLT3_PTD4 KINETIS_MUX('D',4,2)
#define FTM0_FLT3_PTE12 KINETIS_MUX('E',12,2)
#define FTM1_CH0_PTB2 KINETIS_MUX('B',2,2)
#define FTM1_CH0_PTC4 KINETIS_MUX('C',4,2)
#define FTM1_CH1_PTA1 KINETIS_MUX('A',1,2)
#define FTM1_CH1_PTB3 KINETIS_MUX('B',3,2)
#define FTM1_CH2_PTA15 KINETIS_MUX('A',15,2)
#define FTM1_CH2_PTC14 KINETIS_MUX('C',14,2)
#define FTM1_CH3_PTA16 KINETIS_MUX('A',16,2)
#define FTM1_CH3_PTC15 KINETIS_MUX('C',15,2)
#define FTM2_CH0_PTC5 KINETIS_MUX('C',5,2)
#define FTM2_CH0_PTD0 KINETIS_MUX('D',0,4)
#define FTM2_CH0_PTD10 KINETIS_MUX('D',10,2)
#define FTM2_CH1_PTA0 KINETIS_MUX('A',0,2)
#define FTM2_CH1_PTD1 KINETIS_MUX('D',1,4)
#define FTM2_CH1_PTD11 KINETIS_MUX('D',11,2)
#define FTM2_CH2_PTD12 KINETIS_MUX('D',12,2)
#define FTM2_CH2_PTE4 KINETIS_MUX('E',4,4)
#define FTM2_CH3_PTD5 KINETIS_MUX('D',5,2)
#define FTM2_CH3_PTE5 KINETIS_MUX('E',5,4)
#define FXIO_D0_PTA10 KINETIS_MUX('A',10,4)
#define FXIO_D0_PTD0 KINETIS_MUX('D',0,6)
#define FXIO_D1_PTA11 KINETIS_MUX('A',11,4)
#define FXIO_D1_PTD1 KINETIS_MUX('D',1,6)
#define FXIO_D2_PTA0 KINETIS_MUX('A',0,4)
#define FXIO_D2_PTE15 KINETIS_MUX('E',15,6)
#define FXIO_D3_PTA1 KINETIS_MUX('A',1,4)
#define FXIO_D3_PTE16 KINETIS_MUX('E',16,6)
#define FXIO_D4_PTD2 KINETIS_MUX('D',2,4)
#define FXIO_D4_PTE10 KINETIS_MUX('E',10,6)
#define FXIO_D5_PTD3 KINETIS_MUX('D',3,4)
#define FXIO_D5_PTE11 KINETIS_MUX('E',11,6)
#define FXIO_D6_PTA8 KINETIS_MUX('A',8,4)
#define FXIO_D6_PTE4 KINETIS_MUX('E',4,6)
#define FXIO_D7_PTA9 KINETIS_MUX('A',9,4)
#define FXIO_D7_PTE5 KINETIS_MUX('E',5,6)
#define KINETIS_MUX(port, pin, mux)		 (((((port) - 'A') & 0xF) << 28) |	 (((pin) & 0x3F) << 22) |		 (((mux) & 0x7) << 8))
#define LPI2C0_HREQ_PTB11 KINETIS_MUX('B',11,3)
#define LPI2C0_HREQ_PTE1 KINETIS_MUX('E',1,3)
#define LPI2C0_SCLS_PTA0 KINETIS_MUX('A',0,3)
#define LPI2C0_SCLS_PTB9 KINETIS_MUX('B',9,3)
#define LPI2C0_SCL_PTA3 KINETIS_MUX('A',3,3)
#define LPI2C0_SCL_PTB7 KINETIS_MUX('B',7,2)
#define LPI2C0_SDAS_PTA1 KINETIS_MUX('A',1,3)
#define LPI2C0_SDAS_PTB10 KINETIS_MUX('B',10,3)
#define LPI2C0_SDA_PTA2 KINETIS_MUX('A',2,3)
#define LPI2C0_SDA_PTB6 KINETIS_MUX('B',6,2)
#define LPI2C1_HREQ_PTC5 KINETIS_MUX('C',5,4)
#define LPI2C1_HREQ_PTD12 KINETIS_MUX('D',12,3)
#define LPI2C1_SCLS_PTA13 KINETIS_MUX('A',13,4)
#define LPI2C1_SCLS_PTC17 KINETIS_MUX('C',17,4)
#define LPI2C1_SCL_PTD9 KINETIS_MUX('D',9,3)
#define LPI2C1_SCL_PTE1 KINETIS_MUX('E',1,4)
#define LPI2C1_SDAS_PTA12 KINETIS_MUX('A',12,4)
#define LPI2C1_SDAS_PTC16 KINETIS_MUX('C',16,4)
#define LPI2C1_SDA_PTD8 KINETIS_MUX('D',8,3)
#define LPI2C1_SDA_PTE0 KINETIS_MUX('E',0,4)
#define LPSPI0_PCS0_PTB0 KINETIS_MUX('B',0,3)
#define LPSPI0_PCS1_PTB5 KINETIS_MUX('B',5,3)
#define LPSPI0_PCS2_PTE6 KINETIS_MUX('E',6,2)
#define LPSPI0_PCS3_PTA15 KINETIS_MUX('A',15,3)
#define LPSPI0_SCK_PTB2 KINETIS_MUX('B',2,3)
#define LPSPI0_SCK_PTE0 KINETIS_MUX('E',0,2)
#define LPSPI0_SIN_PTB3 KINETIS_MUX('B',3,3)
#define LPSPI0_SIN_PTE1 KINETIS_MUX('E',1,2)
#define LPSPI0_SOUT_PTB1 KINETIS_MUX('B',1,3)
#define LPSPI0_SOUT_PTB4 KINETIS_MUX('B',4,3)
#define LPSPI0_SOUT_PTE2 KINETIS_MUX('E',2,2)
#define LPSPI1_PCS0_PTD3 KINETIS_MUX('D',3,3)
#define LPSPI1_PCS1_PTA6 KINETIS_MUX('A',6,3)
#define LPSPI1_PCS2_PTA16 KINETIS_MUX('A',16,3)
#define LPSPI1_PCS3_PTB17 KINETIS_MUX('B',17,3)
#define LPSPI1_SCK_PTB14 KINETIS_MUX('B',14,3)
#define LPSPI1_SCK_PTD0 KINETIS_MUX('D',0,3)
#define LPSPI1_SIN_PTB15 KINETIS_MUX('B',15,3)
#define LPSPI1_SIN_PTD1 KINETIS_MUX('D',1,3)
#define LPSPI1_SOUT_PTB16 KINETIS_MUX('B',16,3)
#define LPSPI1_SOUT_PTD2 KINETIS_MUX('D',2,3)
#define LPTMR0_ALT1_PTE11 KINETIS_MUX('E',11,3)
#define LPTMR0_ALT2_PTD5 KINETIS_MUX('D',5,3)
#define LPTMR0_ALT3_PTB0 KINETIS_MUX('B',0,4)
#define LPTMR0_ALT3_PTE2 KINETIS_MUX('E',2,3)
#define LPUART0_CTS_PTA0 KINETIS_MUX('A',0,6)
#define LPUART0_CTS_PTC8 KINETIS_MUX('C',8,6)
#define LPUART0_RTS_PTA1 KINETIS_MUX('A',1,6)
#define LPUART0_RTS_PTC9 KINETIS_MUX('C',9,6)
#define LPUART0_RX_PTA11 KINETIS_MUX('A',11,3)
#define LPUART0_RX_PTA2 KINETIS_MUX('A',2,6)
#define LPUART0_RX_PTB0 KINETIS_MUX('B',0,2)
#define LPUART0_TX_PTA10 KINETIS_MUX('A',10,3)
#define LPUART0_TX_PTA3 KINETIS_MUX('A',3,6)
#define LPUART0_TX_PTB1 KINETIS_MUX('B',1,2)
#define LPUART1_CTS_PTA6 KINETIS_MUX('A',6,6)
#define LPUART1_CTS_PTE2 KINETIS_MUX('E',2,6)
#define LPUART1_RTS_PTA7 KINETIS_MUX('A',7,6)
#define LPUART1_RTS_PTE6 KINETIS_MUX('E',6,6)
#define LPUART1_RX_PTC6 KINETIS_MUX('C',6,2)
#define LPUART1_RX_PTC8 KINETIS_MUX('C',8,2)
#define LPUART1_TX_PTC7 KINETIS_MUX('C',7,2)
#define LPUART1_TX_PTC9 KINETIS_MUX('C',9,2)
#define LPUART2_CTS_PTD11 KINETIS_MUX('D',11,6)
#define LPUART2_CTS_PTE9 KINETIS_MUX('E',9,3)
#define LPUART2_RTS_PTD12 KINETIS_MUX('D',12,6)
#define LPUART2_RTS_PTE3 KINETIS_MUX('E',3,3)
#define LPUART2_RX_PTD17 KINETIS_MUX('D',17,3)
#define LPUART2_RX_PTD6 KINETIS_MUX('D',6,2)
#define LPUART2_TX_PTD7 KINETIS_MUX('D',7,2)
#define LPUART2_TX_PTE12 KINETIS_MUX('E',12,3)
#define NMI_b_PTD3 KINETIS_MUX('D',3,7)
#define PTA0 KINETIS_MUX('A',0,1)
#define PTA1 KINETIS_MUX('A',1,1)
#define PTA10 KINETIS_MUX('A',10,1)
#define PTA11 KINETIS_MUX('A',11,1)
#define PTA12 KINETIS_MUX('A',12,1)
#define PTA13 KINETIS_MUX('A',13,1)
#define PTA14 KINETIS_MUX('A',14,1)
#define PTA15 KINETIS_MUX('A',15,1)
#define PTA16 KINETIS_MUX('A',16,1)
#define PTA17 KINETIS_MUX('A',17,1)
#define PTA2 KINETIS_MUX('A',2,1)
#define PTA3 KINETIS_MUX('A',3,1)
#define PTA4 KINETIS_MUX('A',4,1)
#define PTA5 KINETIS_MUX('A',5,1)
#define PTA6 KINETIS_MUX('A',6,1)
#define PTA7 KINETIS_MUX('A',7,1)
#define PTA8 KINETIS_MUX('A',8,1)
#define PTA9 KINETIS_MUX('A',9,1)
#define PTB0 KINETIS_MUX('B',0,1)
#define PTB1 KINETIS_MUX('B',1,1)
#define PTB10 KINETIS_MUX('B',10,1)
#define PTB11 KINETIS_MUX('B',11,1)
#define PTB12 KINETIS_MUX('B',12,1)
#define PTB13 KINETIS_MUX('B',13,1)
#define PTB14 KINETIS_MUX('B',14,1)
#define PTB15 KINETIS_MUX('B',15,1)
#define PTB16 KINETIS_MUX('B',16,1)
#define PTB17 KINETIS_MUX('B',17,1)
#define PTB2 KINETIS_MUX('B',2,1)
#define PTB3 KINETIS_MUX('B',3,1)
#define PTB4 KINETIS_MUX('B',4,1)
#define PTB5 KINETIS_MUX('B',5,1)
#define PTB6 KINETIS_MUX('B',6,1)
#define PTB7 KINETIS_MUX('B',7,1)
#define PTB8 KINETIS_MUX('B',8,1)
#define PTB9 KINETIS_MUX('B',9,1)
#define PTC0 KINETIS_MUX('C',0,1)
#define PTC1 KINETIS_MUX('C',1,1)
#define PTC10 KINETIS_MUX('C',10,1)
#define PTC11 KINETIS_MUX('C',11,1)
#define PTC12 KINETIS_MUX('C',12,1)
#define PTC13 KINETIS_MUX('C',13,1)
#define PTC14 KINETIS_MUX('C',14,1)
#define PTC15 KINETIS_MUX('C',15,1)
#define PTC16 KINETIS_MUX('C',16,1)
#define PTC17 KINETIS_MUX('C',17,1)
#define PTC2 KINETIS_MUX('C',2,1)
#define PTC3 KINETIS_MUX('C',3,1)
#define PTC4 KINETIS_MUX('C',4,1)
#define PTC5 KINETIS_MUX('C',5,1)
#define PTC6 KINETIS_MUX('C',6,1)
#define PTC7 KINETIS_MUX('C',7,1)
#define PTC8 KINETIS_MUX('C',8,1)
#define PTC9 KINETIS_MUX('C',9,1)
#define PTD0 KINETIS_MUX('D',0,1)
#define PTD1 KINETIS_MUX('D',1,1)
#define PTD10 KINETIS_MUX('D',10,1)
#define PTD11 KINETIS_MUX('D',11,1)
#define PTD12 KINETIS_MUX('D',12,1)
#define PTD13 KINETIS_MUX('D',13,1)
#define PTD14 KINETIS_MUX('D',14,1)
#define PTD15 KINETIS_MUX('D',15,1)
#define PTD16 KINETIS_MUX('D',16,1)
#define PTD17 KINETIS_MUX('D',17,1)
#define PTD2 KINETIS_MUX('D',2,1)
#define PTD3 KINETIS_MUX('D',3,1)
#define PTD4 KINETIS_MUX('D',4,1)
#define PTD5 KINETIS_MUX('D',5,1)
#define PTD6 KINETIS_MUX('D',6,1)
#define PTD7 KINETIS_MUX('D',7,1)
#define PTD8 KINETIS_MUX('D',8,1)
#define PTD9 KINETIS_MUX('D',9,1)
#define PTE0 KINETIS_MUX('E',0,1)
#define PTE1 KINETIS_MUX('E',1,1)
#define PTE10 KINETIS_MUX('E',10,1)
#define PTE11 KINETIS_MUX('E',11,1)
#define PTE12 KINETIS_MUX('E',12,1)
#define PTE13 KINETIS_MUX('E',13,1)
#define PTE14 KINETIS_MUX('E',14,1)
#define PTE15 KINETIS_MUX('E',15,1)
#define PTE16 KINETIS_MUX('E',16,1)
#define PTE2 KINETIS_MUX('E',2,1)
#define PTE3 KINETIS_MUX('E',3,1)
#define PTE4 KINETIS_MUX('E',4,1)
#define PTE5 KINETIS_MUX('E',5,1)
#define PTE6 KINETIS_MUX('E',6,1)
#define PTE7 KINETIS_MUX('E',7,1)
#define PTE8 KINETIS_MUX('E',8,1)
#define PTE9 KINETIS_MUX('E',9,1)
#define PWT_IN1_PTE11 KINETIS_MUX('E',11,2)
#define PWT_IN2_PTD5 KINETIS_MUX('D',5,5)
#define PWT_IN3_PTB0 KINETIS_MUX('B',0,5)
#define PWT_IN3_PTE2 KINETIS_MUX('E',2,5)
#define RESET_b_PTA5 KINETIS_MUX('A',5,7)
#define RTC_CLKIN_PTA7 KINETIS_MUX('A',7,4)
#define RTC_CLKOUT_PTC5 KINETIS_MUX('C',5,3)
#define RTC_CLKOUT_PTD13 KINETIS_MUX('D',13,7)
#define SWD_CLK_PTC4 KINETIS_MUX('C',4,7)
#define SWD_DIO_PTA4 KINETIS_MUX('A',4,7)
#define TCLK0_PTB1 KINETIS_MUX('B',1,4)
#define TCLK1_PTA5 KINETIS_MUX('A',5,3)
#define TCLK1_PTE0 KINETIS_MUX('E',0,3)
#define TCLK2_PTE5 KINETIS_MUX('E',5,2)
#define TRGMUX_IN0_PTB5 KINETIS_MUX('B',5,6)
#define TRGMUX_IN1_PTB4 KINETIS_MUX('B',4,6)
#define TRGMUX_IN2_PTB3 KINETIS_MUX('B',3,6)
#define TRGMUX_IN3_PTB2 KINETIS_MUX('B',2,6)
#define TRGMUX_IN4_PTD3 KINETIS_MUX('D',3,6)
#define TRGMUX_IN5_PTD2 KINETIS_MUX('D',2,6)
#define TRGMUX_IN6_PTE3 KINETIS_MUX('E',3,6)
#define TRGMUX_IN7_PTD5 KINETIS_MUX('D',5,6)
#define TRGMUX_OUT0_PTA1 KINETIS_MUX('A',1,7)
#define TRGMUX_OUT1_PTD0 KINETIS_MUX('D',0,7)
#define TRGMUX_OUT2_PTD1 KINETIS_MUX('D',1,7)
#define TRGMUX_OUT3_PTA0 KINETIS_MUX('A',0,7)
#define TRGMUX_OUT4_PTE10 KINETIS_MUX('E',10,7)
#define TRGMUX_OUT5_PTE11 KINETIS_MUX('E',11,7)
#define TRGMUX_OUT6_PTE15 KINETIS_MUX('E',15,7)
#define TRGMUX_OUT7_PTE16 KINETIS_MUX('E',16,7)
#define XTAL_PTB6 KINETIS_MUX('B',6,0)
#define ADC0_SE0_PTE9 KINETIS_MUX('E',9,0)
#define ADC0_SE10_PTC0 KINETIS_MUX('C',0,0)
#define ADC0_SE11_PTD6 KINETIS_MUX('D',6,0)
#define ADC0_SE12_PTC17 KINETIS_MUX('C',17,0)
#define ADC0_SE13_PTD7 KINETIS_MUX('D',7,0)
#define ADC0_SE15_PTC2 KINETIS_MUX('C',2,0)
#define ADC0_SE16_PTC15 KINETIS_MUX('C',15,0)
#define ADC0_SE17_PTC14 KINETIS_MUX('C',14,0)
#define ADC0_SE18_PTB3 KINETIS_MUX('B',3,0)
#define ADC0_SE19_PTB2 KINETIS_MUX('B',2,0)
#define ADC0_SE1_PTE8 KINETIS_MUX('E',8,0)
#define ADC0_SE20_PTB1 KINETIS_MUX('B',1,0)
#define ADC0_SE21_PTB0 KINETIS_MUX('B',0,0)
#define ADC0_SE22_PTC9 KINETIS_MUX('C',9,0)
#define ADC0_SE24_PTC8 KINETIS_MUX('C',8,0)
#define ADC0_SE2_PTD15 KINETIS_MUX('D',15,0)
#define ADC0_SE3_PTB5 KINETIS_MUX('B',5,0)
#define ADC0_SE4_PTD16 KINETIS_MUX('D',16,0)
#define ADC0_SE5_PTB4 KINETIS_MUX('B',4,0)
#define ADC0_SE6_PTE3 KINETIS_MUX('E',3,0)
#define ADC0_SE7_PTC3 KINETIS_MUX('C',3,0)
#define ADC0_SE8_PTC1 KINETIS_MUX('C',1,0)
#define ADC0_SE9_PTD5 KINETIS_MUX('D',5,0)
#define FTM0_CH0_PTB10 KINETIS_MUX('B',10,2)
#define FTM0_CH1_PTB11 KINETIS_MUX('B',11,2)
#define FTM0_CH7_PTD8 KINETIS_MUX('D',8,2)
#define FXIO_D0_PTB10 KINETIS_MUX('B',10,6)
#define FXIO_D1_PTB11 KINETIS_MUX('B',11,6)
#define FXIO_D2_PTD9 KINETIS_MUX('D',9,6)
#define FXIO_D3_PTD5 KINETIS_MUX('D',5,4)
#define FXIO_D4_PTB8 KINETIS_MUX('B',8,6)
#define FXIO_D5_PTB9 KINETIS_MUX('B',9,6)
#define FXIO_D6_PTC2 KINETIS_MUX('C',2,6)
#define FXIO_D7_PTC3 KINETIS_MUX('C',3,6)
#define LPI2C0_SCL_PTB8 KINETIS_MUX('B',8,4)
#define LPI2C0_SCL_PTD3 KINETIS_MUX('D',3,5)
#define LPI2C0_SDA_PTA16 KINETIS_MUX('A',16,4)
#define LPI2C0_SDA_PTD2 KINETIS_MUX('D',2,5)
#define LPSPI0_PCS0_PTC13 KINETIS_MUX('C',13,5)
#define LPSPI0_PCS1_PTD8 KINETIS_MUX('D',8,5)
#define LPSPI0_PCS3_PTA7 KINETIS_MUX('A',7,3)
#define LPSPI0_SCK_PTC10 KINETIS_MUX('C',10,5)
#define LPSPI0_SIN_PTC11 KINETIS_MUX('C',11,5)
#define LPSPI0_SOUT_PTC12 KINETIS_MUX('C',12,5)
#define LPUART0_RX_PTA13 KINETIS_MUX('A',13,5)
#define LPUART0_RX_PTB6 KINETIS_MUX('B',6,3)
#define LPUART0_TX_PTA12 KINETIS_MUX('A',12,5)
#define LPUART0_TX_PTB7 KINETIS_MUX('B',7,3)
#define LPUART1_RX_PTC4 KINETIS_MUX('C',4,3)
#define LPUART1_RX_PTD13 KINETIS_MUX('D',13,3)
#define LPUART1_TX_PTA4 KINETIS_MUX('A',4,3)
#define LPUART1_TX_PTD14 KINETIS_MUX('D',14,3)
#define LPUART2_CTS_PTD5 KINETIS_MUX('D',5,7)
#define SCI0_RX_PTC0 KINETIS_MUX('C',0,4)
#define SCI0_RX_PTC14 KINETIS_MUX('C',14,4)
#define SCI0_TX_PTC1 KINETIS_MUX('C',1,4)
#define SCI0_TX_PTC15 KINETIS_MUX('C',15,4)
#define SCI1_RX_PTB12 KINETIS_MUX('B',12,6)
#define SCI1_RX_PTC16 KINETIS_MUX('C',16,6)
#define SCI1_TX_PTB13 KINETIS_MUX('B',13,6)
#define SCI1_TX_PTC17 KINETIS_MUX('C',17,6)
#define TRGMUX_OUT0_PTA8 KINETIS_MUX('A',8,7)
#define TRGMUX_OUT1_PTA9 KINETIS_MUX('A',9,7)
#define TRGMUX_OUT2_PTD17 KINETIS_MUX('D',17,7)
#define TRGMUX_OUT3_PTE12 KINETIS_MUX('E',12,7)
#define TRGMUX_OUT4_PTE14 KINETIS_MUX('E',14,7)
#define TRGMUX_OUT5_PTE13 KINETIS_MUX('E',13,7)
#define TSI0_CH0_PTE6 KINETIS_MUX('E',6,0)
#define TSI0_CH10_PTE10 KINETIS_MUX('E',10,0)
#define TSI0_CH11_PTD1 KINETIS_MUX('D',1,0)
#define TSI0_CH12_PTD0 KINETIS_MUX('D',0,0)
#define TSI0_CH13_PTE16 KINETIS_MUX('E',16,0)
#define TSI0_CH14_PTE15 KINETIS_MUX('E',15,0)
#define TSI0_CH15_PTE13 KINETIS_MUX('E',13,0)
#define TSI0_CH16_PTE5 KINETIS_MUX('E',5,0)
#define TSI0_CH17_PTE4 KINETIS_MUX('E',4,0)
#define TSI0_CH18_PTE3 KINETIS_MUX('E',3,0)
#define TSI0_CH19_PTD16 KINETIS_MUX('D',16,0)
#define TSI0_CH1_PTE2 KINETIS_MUX('E',2,0)
#define TSI0_CH20_PTD15 KINETIS_MUX('D',15,0)
#define TSI0_CH21_PTE9 KINETIS_MUX('E',9,0)
#define TSI0_CH22_PTE8 KINETIS_MUX('E',8,0)
#define TSI0_CH23_PTB5 KINETIS_MUX('B',5,0)
#define TSI0_CH24_PTB4 KINETIS_MUX('B',4,0)
#define TSI0_CH2_PTA13 KINETIS_MUX('A',13,0)
#define TSI0_CH3_PTA12 KINETIS_MUX('A',12,0)
#define TSI0_CH4_PTA11 KINETIS_MUX('A',11,0)
#define TSI0_CH5_PTA10 KINETIS_MUX('A',10,0)
#define TSI0_CH6_PTE1 KINETIS_MUX('E',1,0)
#define TSI0_CH7_PTE0 KINETIS_MUX('E',0,0)
#define TSI0_CH8_PTC5 KINETIS_MUX('C',5,0)
#define TSI0_CH9_PTE11 KINETIS_MUX('E',11,0)
#define TSI1_CH0_PTC6 KINETIS_MUX('C',6,0)
#define TSI1_CH10_PTE7 KINETIS_MUX('E',7,0)
#define TSI1_CH11_PTA6 KINETIS_MUX('A',6,0)
#define TSI1_CH12_PTA7 KINETIS_MUX('A',7,0)
#define TSI1_CH13_PTC8 KINETIS_MUX('C',8,0)
#define TSI1_CH14_PTC9 KINETIS_MUX('C',9,0)
#define TSI1_CH15_PTB0 KINETIS_MUX('B',0,0)
#define TSI1_CH16_PTB1 KINETIS_MUX('B',1,0)
#define TSI1_CH17_PTB2 KINETIS_MUX('B',2,0)
#define TSI1_CH18_PTB3 KINETIS_MUX('B',3,0)
#define TSI1_CH19_PTC14 KINETIS_MUX('C',14,0)
#define TSI1_CH1_PTC7 KINETIS_MUX('C',7,0)
#define TSI1_CH20_PTC15 KINETIS_MUX('C',15,0)
#define TSI1_CH21_PTC16 KINETIS_MUX('C',16,0)
#define TSI1_CH22_PTC17 KINETIS_MUX('C',17,0)
#define TSI1_CH23_PTC0 KINETIS_MUX('C',0,0)
#define TSI1_CH24_PTC1 KINETIS_MUX('C',1,0)
#define TSI1_CH2_PTA0 KINETIS_MUX('A',0,0)
#define TSI1_CH3_PTA1 KINETIS_MUX('A',1,0)
#define TSI1_CH4_PTA2 KINETIS_MUX('A',2,0)
#define TSI1_CH5_PTA3 KINETIS_MUX('A',3,0)
#define TSI1_CH6_PTD2 KINETIS_MUX('D',2,0)
#define TSI1_CH7_PTD4 KINETIS_MUX('D',4,0)
#define TSI1_CH8_PTB12 KINETIS_MUX('B',12,0)
#define TSI1_CH9_PTB13 KINETIS_MUX('B',13,0)

#endif /* _ZEPHYR_DTS_BINDING_MKE17Z512VLL9_ */
